app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ja"], ["updated_at", 2016-12-16 20:19:50 UTC], ["id", 32]]
---
    def update
      @user = User.find(params[:id])
      # if current_user == @user
        if @user.update(user_params)